backend/app/controllers/candidates_controller.rb

SELECT "candidates".* FROM "candidates" WHERE "candidates"."voting_event_id" = ?  [["voting_event_id", 21]]
---
  def by_voting_event
    @candidates = Candidate.where(voting_event_id: params[:voting_event_id])