backend/app/controllers/candidates_controller.rb

  def create
    @candidate = Candidate.new(candidate_params)

    respond_to do |format|
      if @candidate.save
---
INSERT INTO "candidates" ("role", "userName", "voting_event_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["role", "President"], ["userName", "Raila Odinga"], ["voting_event_id", 1], ["user_id", 1], ["created_at", "2023-08-06 10:35:19.521128"], ["updated_at", "2023-08-06 10:35:19.521128"]]

  def update
    respond_to do |format|
      if @candidate.update(candidate_params)
---
UPDATE "candidates" SET "role" = ?, "updated_at" = ? WHERE "candidates"."id" = ?  [["role", "MP"], ["updated_at", "2023-07-29 11:45:40.432368"], ["id", 1]]

  def destroy
    @candidate.destroy
---
DELETE FROM "candidates" WHERE "candidates"."id" = ?  [["id", 1]]

    def set_candidate
      @candidate = Candidate.find(params[:id])
---
SELECT "candidates".* FROM "candidates" WHERE "candidates"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]