backend/app/controllers/feedbacks_controller.rb

SELECT "feedbacks".* FROM "feedbacks"
---
  def index
    @feedbacks = Feedback.all

INSERT INTO "feedbacks" ("eventName", "message", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["eventName", "general elections"], ["message", "ended early"], ["user_id", 1], ["created_at", "2023-07-29 09:04:08.195494"], ["updated_at", "2023-07-29 09:04:08.195494"]]
---
  def create
    if @current_user
      @feedback = @current_user.feedbacks.build(feedback_params)

      if @feedback.save

DELETE FROM "feedbacks" WHERE "feedbacks"."id" = ?  [["id", 2]]
---
  def destroy
    if @current_user && @feedback.destroy

SELECT "feedbacks".* FROM "feedbacks" WHERE "feedbacks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_feedback
    @feedback = Feedback.find_by(id: params[:id])