backend/app/controllers/user_votes_controller.rb

  def index
    @user_votes = UserVote.all
---
SELECT "user_votes".* FROM "user_votes"

  def create
    @user_vote = UserVote.new(user_vote_params)

    respond_to do |format|
      if @user_vote.save
---
INSERT INTO "user_votes" ("userName", "eventName", "created_at", "updated_at", "voting_event_id", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["userName", "doejohn"], ["eventName", "general elections"], ["created_at", "2023-07-29 11:30:22.378791"], ["updated_at", "2023-07-29 11:30:22.378791"], ["voting_event_id", 1], ["user_id", 1]]

  def update
    respond_to do |format|
      if @user_vote.update(user_vote_params)
---
UPDATE "user_votes" SET "eventName" = ?, "updated_at" = ? WHERE "user_votes"."id" = ?  [["eventName", " by-elections"], ["updated_at", "2023-07-29 11:32:21.484906"], ["id", 1]]

  def destroy
    @user_vote.destroy
---
DELETE FROM "user_votes" WHERE "user_votes"."id" = ?  [["id", 1]]

    def set_user_vote
      @user_vote = UserVote.find(params[:id])
---
SELECT "user_votes".* FROM "user_votes" WHERE "user_votes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]